tap "homebrew/cask-fonts"
tap "thoughtbot/formulae"

# Core CLI (aligned with packages.txt / terminal UX; Node via nvm in shell, not duplicate brew node)
brew "git"
brew "micro"
brew "zsh"
brew "starship"
brew "tmux"
brew "bat"
brew "ripgrep"
brew "fd"
brew "eza"
brew "lnav"
brew "gh"
brew "zoxide"
brew "chezmoi"
brew "btop"
brew "z"
brew "rcm"
brew "mas"
brew "screenfetch"

# Media & utilities (install yarn via `corepack enable` when a project needs it, or: brew install yarn)
brew "p7zip"
brew "ffmpeg"

# Editor (optional heavyweight)
brew "doom-emacs"

# Casks - System & Utilities
cask "balenaetcher"
cask "iterm2"
cask "karabiner-elements"
cask "stats"
cask "the-unarchiver"

# Casks - Development
cask "docker"
cask "docker-desktop"

# Casks - Media & Content
cask "blender"
cask "flacon"
cask "lidarr"
cask "obsidian"
cask "radarr"
cask "sonarr"
cask "soulver"

# Casks - Security
cask "metasploit"

# Casks - File sharing
cask "transmission"

# Casks - Fonts
cask "font-fira-code"
cask "font-jetbrains-mono-nerd-font"
