tap "homebrew/cask-fonts"
tap "thoughtbot/formulae"
tap "mongodb/brew"
tap "hazcod/homebrew-hazcod"

# Essential tools
brew "git"
brew "neovim"
brew "micro"
brew "zsh"
brew "z"
brew "rcm"
brew "mas"
brew "screenfetch"

# Media & utilities
brew "p7zip"
brew "ffmpeg"
brew "yarn"

# Editor alternatives
brew "doom-emacs"

# Casks - System & Utilities
cask "balenaetcher"
cask "iterm2"
cask "karabiner-elements"
cask "marta"
cask "stats"
cask "the-unarchiver"
cask "thunderbird"

# Casks - Development
cask "docker"
cask "docker-desktop"

# Casks - Media & Content
cask "blender"
cask "flacon"
cask "iina"
cask "lidarr"
cask "logseq"
cask "obsidian"
cask "radarr"
cask "sonarr"
cask "soulver"

# Casks - Security
cask "metasploit"

# Casks - File sharing
cask "transmission"

# Casks - Fonts
cask "font-fira-code"